# KeyValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..KeyValue Property
ParameterTypeId Class See Also
---
"Key Value"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId KeyValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KeyValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KeyValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace